app/controllers/cars_controller.rb

    def index
        cars = Car.all
---
SELECT "cars".* FROM "cars"

    def show
        car = Car.find(params[:id])
---
SELECT "cars".* FROM "cars" WHERE "cars"."id" = 1 LIMIT 1